app/controllers/cidades_controller.rb

  def index
    @cidades = Cidade.all
---
SELECT * FROM `cidades`

  def show
    @cidade = Cidade.find(params[:id])
---
SELECT * FROM `cidades` WHERE (`cidades`.`id` = 1)

  def edit
    @cidade = Cidade.find(params[:id])
---
SELECT * FROM `cidades` WHERE (`cidades`.`id` = 1)

  def create
    @cidade = Cidade.new(params[:cidade])

    respond_to do |format|
      if @cidade.save
---
INSERT INTO `cidades` (`created_at`, `estado_id`, `nome`, `updated_at`) VALUES('2010-07-25 02:43:57', NULL, 'Sao Paulo', '2010-07-25 02:43:57')

  def update
    @cidade = Cidade.find(params[:id])

    respond_to do |format|
      if @cidade.update_attributes(params[:cidade])
---
SELECT * FROM `cidades` WHERE (`cidades`.`id` = 1)
UPDATE `cidades` SET `nome` = 'Anapolis', `updated_at` = '2013-11-12 21:40:19' WHERE `id` = 1

  def destroy
    @cidade = Cidade.find(params[:id])
    @cidade.destroy
---
SELECT * FROM `cidades` WHERE (`cidades`.`id` = 1)
DELETE FROM `cidades` WHERE `id` = 1

def load_estados
  @estado = Estado.all.collect { |c| [c.nome, c.id] }
---
SELECT * FROM `estados`