app/controllers/clientes_controller.rb

  def index
    #@clientes = Cliente.all :order => 'nome'

    @clientes = Cliente.paginate :page  => params[:page], :per_page => 2
---
SELECT * FROM `clientes` ORDER BY nome
SELECT count(*) AS count_all FROM `clientes`

  def busca_clientes
    @clientes = Cliente.find(:all, :order => 'nome', :conditions => ['nome LIKE ?', "%#{params[:q]}%"])
---
SELECT * FROM `clientes` WHERE (nome LIKE '%er%') ORDER BY nome

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`nome`, `endereco`, `bairro`, `cpf`, `rg`, `telefone`, `celular`, `telefone_contato`, `email`, `sexo`, `profissao`, `cep`, `cidade_id`, `created_at`, `updated_at`, `data_cadastro`) VALUES('Wendell Silva Bandeira', 'Rua. Rui Barbosa L. 20 Q. 53', 'Alexandrina', '002.116.741.92', '4432871', '33219999', '91361619', '', 'wendbandeira@gmail.com', 'MASCULINO', 'Coordenador de TI', '75116780', 1, '2013-11-12 21:41:26', '2013-11-12 21:41:26', NULL)

  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 3)
UPDATE `clientes` SET `updated_at` = '2010-07-25 23:13:46', `nome` = 'JackBauer II' WHERE `id` = 3

  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)
DELETE FROM `clientes` WHERE `id` = 1

    def load_cidades
         @cidade = Cidade.all.collect { |c| [c.nome, c.id] }
---
SELECT * FROM `cidades`