app/controllers/fornecedores_controller.rb

SELECT * FROM `fornecedores`
---
  def index
    @fornecedores = Fornecedore.all

SELECT * FROM `fornecedores` WHERE (`fornecedores`.`id` = 1)
---
  def show
    @fornecedore = Fornecedore.find(params[:id])

INSERT INTO `fornecedores` (`endereco`, `telefone`, `created_at`, `cidade_id`, `nome`, `cep`, `updated_at`, `data_cadastro`, `cnpj`, `bairro`, `fax`, `site`, `ins_estadual`, `email`) VALUES('Rua nova olinda', '9999 9999', '2010-07-29 01:22:56', 1, 'Wendell Silva Bandeira', '', '2010-07-29 01:22:56', '01/01/2010', '0000000000', 'Alexandrina', '3333 33333', 'www.caio.com.br', '000000', 'caio@caio.com.br')
---
  def create
    @fornecedore = Fornecedore.new(params[:fornecedore])

    respond_to do |format|
      if @fornecedore.save

SELECT * FROM `cidades`
---
  def load_cidades
    @cidade = Cidade.all.collect {|c| [c.nome, c.id]}