app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all
---
SELECT * FROM `funcionarios`

  def show
    @funcionario = Funcionario.find(params[:id])
---
SELECT * FROM `funcionarios` WHERE (`funcionarios`.`id` = 4)

  def edit
    @funcionario = Funcionario.find(params[:id])
---
SELECT * FROM `funcionarios` WHERE (`funcionarios`.`id` = 4)

  def create
    @funcionario = Funcionario.new(params[:funcionario])

    respond_to do |format|
      if @funcionario.save
---
INSERT INTO `funcionarios` (`nome`, `login`, `senha`, `endereco`, `telefone`, `data_entrada`, `status`, `cargo_id`, `cidade_id`, `created_at`, `updated_at`) VALUES('Wendell Bandeira', 'wendeira', 'bandeira', 'R. Rui Barbosa L.20 Q.53', '91361619', '2013-11-12 21:51:00', 1, 1, 1, '2013-11-12 21:52:09', '2013-11-12 21:52:09')

  def update
    @funcionario = Funcionario.find(params[:id])

    respond_to do |format|
      if @funcionario.update_attributes(params[:funcionario])
---
SELECT * FROM `funcionarios` WHERE (`funcionarios`.`id` = 4)
UPDATE `funcionarios` SET `status` = 0, `updated_at` = '2013-11-12 21:57:53' WHERE `id` = 4

  def destroy
    @funcionario = Funcionario.find(params[:id])
    @funcionario.destroy
---
SELECT * FROM `funcionarios` WHERE (`funcionarios`.`id` = 3)
DELETE FROM `funcionarios` WHERE `id` = 3

  def load_cidades
      @cidade = Cidade.all.collect {|c| [c.nome, c.id]}
---
SELECT * FROM `cidades`

def load_cargos
  @cargo = Cargo.all.collect {|c| [c.nome, c.id]}
---
SELECT * FROM `cargos`