app/controllers/home_controller.rb

SELECT * FROM `clientes` ORDER BY id desc
---
  def index
  	@clientes = Cliente.all :order => 'id desc'