app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.paginate :page => params[:page], :per_page => 2
---
SELECT * FROM `produtos` LIMIT 0, 2
SELECT count(*) AS count_all FROM `produtos`

  def show
    @produto = Produto.find(params[:id])
---
SELECT * FROM `produtos` WHERE (`produtos`.`id` = 1)

  def edit
    @produto = Produto.find(params[:id])
---
SELECT * FROM `produtos` WHERE (`produtos`.`id` = 5)

  def create
    @produto = Produto.new(params[:produto])

    respond_to do |format|
      if @produto.save
---
INSERT INTO `produtos` (`data_cadastro`, `nome`, `tamanho`, `valor_compra`, `valor_venda`, `quantidade`, `n_nota_fiscal`, `fornecedore_id`, `categoria_id`, `created_at`, `updated_at`) VALUES(NULL, 'Vestido Amarelo', 'M', 50.0, 51.0, 2, 222, 1, 1, '2013-11-13 21:59:36', '2013-11-13 21:59:36')

  def destroy
    @produto = Produto.find(params[:id])
    @produto.destroy
---
SELECT * FROM `produtos` WHERE (`produtos`.`id` = 2)
DELETE FROM `produtos` WHERE `id` = 2

  def buscar_produtos
    @produtos = Produto.find(:all, :order => 'nome', :conditions => ['nome LIKE ?', "%#{params[:produto]}%"])
---
SELECT * FROM `produtos` WHERE (nome LIKE '%nano%') ORDER BY nome

  def load_categorias
    @categoria = Categoria.all.collect {|c| [c.nome, c.id]}
---
SELECT * FROM `categorias`

  def load_fornecedores
    @fornecedore = Fornecedore.all.collect {|c| [c.nome, c.id]}
---
SELECT * FROM `fornecedores`