app/controllers/vendas_controller.rb

SELECT * FROM `vendas`
---
  def index
    @vendas = Venda.all

SELECT * FROM `vendas` WHERE (`vendas`.`id` = 1)
---
  def show
    @venda = Venda.find(params[:id])

INSERT INTO `vendas` (`produto_id`, `created_at`, `funcionario_id`, `updated_at`, `cliente_id`, `parcelas`, `quantidade`, `data_venda`, `valor_total`) VALUES(NULL, '2010-07-25 04:02:41', NULL, '2010-07-25 04:02:41', NULL, NULL, NULL, '2010-07-27 04:02:00', NULL)
---
  def create
    @venda = Venda.new(params[:venda])

    respond_to do |format|
      if @venda.save

SELECT * FROM `vendas` WHERE (`vendas`.`id` = 1)
DELETE FROM `vendas` WHERE `id` = 1
---
  def destroy
    @venda = Venda.find(params[:id])
    @venda.destroy

SELECT * FROM `clientes`
---
def load_clientes
  @clientes = Cliente.all.collect { |c| [c.nome, c.id]}

SELECT * FROM `funcionarios`
---
def load_funcionarios
  @funcionario = Funcionario.all.collect { |c| [c.nome, c.id]}

SELECT * FROM `produtos`
---
def load_produtos
  @produto = Produto.all.collect { |c| [c.nome, c.id]}